var cityData = [ {
	"value" : "150821103",
	"text" : "新公中镇",
	"children" : [ {
		"text" : "永旺村",
		"value" : "150821103200"
	}, {
		"text" : "光胜村",
		"value" : "150821103201"
	}, {
		"text" : "民利村",
		"value" : "150821103202"
	}, {
		"text" : "合少村",
		"value" : "150821103203"
	}, {
		"text" : "永生村",
		"value" : "150821103204"
	}, {
		"text" : "旭日村",
		"value" : "150821103205"
	}, {
		"text" : "永胜村",
		"value" : "150821103206"
	}, {
		"text" : "永联村",
		"value" : "150821103207"
	}, {
		"text" : "团结村",
		"value" : "150821103208"
	}, {
		"text" : "永丰村",
		"value" : "150821103209"
	}, {
		"text" : "创业村",
		"value" : "150821103210"
	}, {
		"text" : "光明村",
		"value" : "150821103211"
	}, {
		"text" : "光联村",
		"value" : "150821103212"
	}, {
		"text" : "联胜村",
		"value" : "150821103213"
	}, {
		"text" : "丰联村",
		"value" : "150821103214"
	} ]
}, {
	"value" : "150821100",
	"text" : "隆兴昌镇",
	"children" : [ {
		"text" : "乌兰村",
		"value" : "150821100200"
	}, {
		"text" : "浩丰村",
		"value" : "150821100201"
	}, {
		"text" : "东牛犋村",
		"value" : "150821100202"
	}, {
		"text" : "联合村",
		"value" : "150821100203"
	}, {
		"text" : "旧城村",
		"value" : "150821100204"
	}, {
		"text" : "隆盛村",
		"value" : "150821100205"
	}, {
		"text" : "跃进村",
		"value" : "150821100206"
	}, {
		"text" : "迎丰村",
		"value" : "150821100207"
	}, {
		"text" : "先锋村",
		"value" : "150821100208"
	}, {
		"text" : "荣丰村",
		"value" : "150821100209"
	}, {
		"text" : "荣义村",
		"value" : "150821100210"
	}, {
		"text" : "永跃村",
		"value" : "150821100211"
	}, {
		"text" : "联丰村",
		"value" : "150821100212"
	}, {
		"text" : "荣誉村",
		"value" : "150821100213"
	}, {
		"text" : "宏伟村",
		"value" : "150821100214"
	}, {
		"text" : "永星村",
		"value" : "150821100215"
	}, {
		"text" : "义丰村",
		"value" : "150821100216"
	}, {
		"text" : "新兴村",
		"value" : "150821100217"
	}, {
		"text" : "同联村",
		"value" : "150821100218"
	}, {
		"text" : "联乐村",
		"value" : "150821100219"
	}, {
		"text" : "和丰村",
		"value" : "150821100220"
	}, {
		"text" : "五星村",
		"value" : "150821100221"
	}, {
		"text" : "光明村",
		"value" : "150821100222"
	}, {
		"text" : "新福村",
		"value" : "150821100223"
	} ]
}, {
	"value" : "150821101",
	"text" : "塔尔湖镇",
	"children" : [ {
		"text" : "常丰村",
		"value" : "150821101200"
	}, {
		"text" : "联丰村",
		"value" : "150821101201"
	}, {
		"text" : "春光村",
		"value" : "150821101202"
	}, {
		"text" : "胜丰村",
		"value" : "150821101203"
	}, {
		"text" : "春联村",
		"value" : "150821101204"
	}, {
		"text" : "丰产村",
		"value" : "150821101205"
	}, {
		"text" : "金星村",
		"value" : "150821101206"
	}, {
		"text" : "刀老召村",
		"value" : "150821101207"
	}, {
		"text" : "丰胜村",
		"value" : "150821101208"
	}, {
		"text" : "丰裕村",
		"value" : "150821101209"
	}, {
		"text" : "丰华村",
		"value" : "150821101210"
	}, {
		"text" : "红光村",
		"value" : "150821101211"
	}, {
		"text" : "金丰村",
		"value" : "150821101212"
	}, {
		"text" : "金联村",
		"value" : "150821101213"
	}, {
		"text" : "乃日村",
		"value" : "150821101214"
	}, {
		"text" : "五份桥村",
		"value" : "150821101215"
	}, {
		"text" : "海丰村",
		"value" : "150821101216"
	}, {
		"text" : "蛇林村",
		"value" : "150821101217"
	}, {
		"text" : "继光村",
		"value" : "150821101218"
	}, {
		"text" : "先锋村",
		"value" : "150821101219"
	} ]
}, {
	"value" : "150821102",
	"text" : "巴彦套海镇",
	"children" : [ {
		"text" : "红丰村",
		"value" : "150821102200"
	}, {
		"text" : "赛丰村",
		"value" : "150821102201"
	}, {
		"text" : "南毛庵",
		"value" : "150821102202"
	}, {
		"text" : "风雷村",
		"value" : "150821102203"
	}, {
		"text" : "和平村",
		"value" : "150821102204"
	}, {
		"text" : "红旗村",
		"value" : "150821102205"
	}, {
		"text" : "锦秀堂村",
		"value" : "150821102206"
	}, {
		"text" : "锦旗村",
		"value" : "150821102207"
	}, {
		"text" : "先进村",
		"value" : "150821102208"
	}, {
		"text" : "响导村",
		"value" : "150821102209"
	}, {
		"text" : "永生村",
		"value" : "150821102210"
	}, {
		"text" : "向阳村",
		"value" : "150821102211"
	}, {
		"text" : "红赛村",
		"value" : "150821102212"
	}, {
		"text" : "白艮居",
		"value" : "150821102001"
	}, {
		"text" : "铁路居",
		"value" : "150821102002"
	} ]
}, {
	"value" : "150821104",
	"text" : "天吉太镇",
	"children" : [ {
		"text" : "天吉太村",
		"value" : "150821104200"
	}, {
		"text" : "兴丰村",
		"value" : "150821104201"
	}, {
		"text" : "毛家桥村",
		"value" : "150821104202"
	}, {
		"text" : "熊万库村",
		"value" : "150821104203"
	}, {
		"text" : "二合永村",
		"value" : "150821104204"
	}, {
		"text" : "永红村",
		"value" : "150821104205"
	}, {
		"text" : "景华村",
		"value" : "150821104206"
	}, {
		"text" : "景阳林村",
		"value" : "150821104207"
	}, {
		"text" : "复丰村",
		"value" : "150821104208"
	} ]
}, {
	"value" : "150821105",
	"text" : "胜丰镇",
	"children" : [ {
		"text" : "新红村",
		"value" : "150821105200"
	}, {
		"text" : "新华村",
		"value" : "150821105201"
	}, {
		"text" : "西圪梁村",
		"value" : "150821105202"
	}, {
		"text" : "新丰村",
		"value" : "150821105203"
	}, {
		"text" : "三黄保村",
		"value" : "150821105204"
	}, {
		"text" : "新胜村",
		"value" : "150821105205"
	}, {
		"text" : "红隆永村",
		"value" : "150821105206"
	}, {
		"text" : "夹道子村",
		"value" : "150821105207"
	}, {
		"text" : "美联村",
		"value" : "150821105208"
	}, {
		"text" : "明丰村",
		"value" : "150821105209"
	}, {
		"text" : "明星村",
		"value" : "150821105210"
	}, {
		"text" : "明联村",
		"value" : "150821105211"
	}, {
		"text" : "美星村",
		"value" : "150821105212"
	}, {
		"text" : "美丰村",
		"value" : "150821105213"
	} ]
}, {
	"value" : "150821106",
	"text" : "银定图镇",
	"children" : [ {
		"text" : "丰乐村",
		"value" : "150821106200"
	}, {
		"text" : "前进村",
		"value" : "150821106201"
	}, {
		"text" : "建设村",
		"value" : "150821106202"
	}, {
		"text" : "协成桥村",
		"value" : "150821106203"
	}, {
		"text" : "宏胜村",
		"value" : "150821106204"
	}, {
		"text" : "胜利村",
		"value" : "150821106205"
	}, {
		"text" : "新旺村",
		"value" : "150821106206"
	} ]
}, {
	"value" : "150821107",
	"text" : "复兴镇",
	"children" : [ {
		"text" : "复兴村",
		"value" : "150821107200"
	}, {
		"text" : "庆丰村",
		"value" : "150821107201"
	}, {
		"text" : "联丰村",
		"value" : "150821107202"
	}, {
		"text" : "永丰村",
		"value" : "150821107203"
	}, {
		"text" : "庆生村",
		"value" : "150821107204"
	}, {
		"text" : "和胜村",
		"value" : "150821107205"
	}, {
		"text" : "顺利村",
		"value" : "150821107206"
	}, {
		"text" : "民生村",
		"value" : "150821107207"
	} ]
}, {
	"value" : "150821200",
	"text" : "和胜乡",
	"children" : [ {
		"text" : "和平村",
		"value" : "150821200200"
	}, {
		"text" : "和义村",
		"value" : "150821200201"
	}, {
		"text" : "和胜村",
		"value" : "150821200202"
	}, {
		"text" : "新建村",
		"value" : "150821200203"
	}, {
		"text" : "建丰村",
		"value" : "150821200204"
	}, {
		"text" : "新永村",
		"value" : "150821200205"
	}, {
		"text" : "新丰村",
		"value" : "150821200206"
	} ]
}, {
	"value" : "150821400",
	"text" : "建丰农场",
	"children" : [ {
		"text" : "十一分场村",
		"value" : "150821400500"
	}, {
		"text" : "一分场村",
		"value" : "150821400501"
	}, {
		"text" : "二分场村",
		"value" : "150821400502"
	}, {
		"text" : "三分场村",
		"value" : "150821400503"
	}, {
		"text" : "四分场村",
		"value" : "150821400504"
	}, {
		"text" : "五分场村",
		"value" : "150821400505"
	}, {
		"text" : "六分场村",
		"value" : "150821400506"
	}, {
		"text" : "七分场村",
		"value" : "150821400507"
	}, {
		"text" : "八分场村",
		"value" : "150821400508"
	}, {
		"text" : "九分场村",
		"value" : "150821400509"
	}, {
		"text" : "十分场村",
		"value" : "150821400510"
	} ]
} ];